from flask import Flask
import random
import string

app = Flask(__name__)

facts_list = [
    "Большинство людей, страдающих технологической зависимостью, испытывают сильный стресс, когда они находятся вне зоны покрытия сети или не могут использовать свои устройства.",
    "Согласно исследованию, проведенному в 2018 году, более 50% людей в возрасте от 18 до 34 лет считают себя зависимыми от своих смартфонов.",
    "Изучение технологической зависимости является одной из наиболее актуальных областей научных исследований в настоящее время.",
    "Согласно исследованию, проведенному в 2019 году, более 60% людей отвечают на рабочие сообщения в своих смартфонах в течение 15 минут после того, как они вышли с работы.",
    "Один из способов борьбы с технологической зависимостью - это поиск занятий, которые приносят удовольствие и улучшают настроение.",
    "Илон Маск утверждает, что социальные сети созданы для того, чтобы удерживать нас внутри платформы, чтобы мы тратили как можно больше времени на просмотр контента.",
    "Илон Маск также выступает за регулирование социальных сетей и защиту личных данных пользователей. Он утверждает, что социальные сети собирают огромное количество информации о нас, которую потом можно использовать для манипулирования нашими мыслями и поведением.",
    "Социальные сети имеют как позитивные, так и негативные стороны, и мы должны быть более осознанными в использовании этих платформ."
]

monetka_list = [
    "Тебе выпал орел",
    "Тебе выпала решка"
]


@app.route("/")
def index():
    return f'<p><a href="/monetka_random">Поиграть в подбрасывание монетки!</a></p>' \
           f'<p><a href="/random_fact">Посмотреть случайный факт!</a></p>' \
           f'<p><a href="/generate_password">Сгенерировать пароль</a></p>'


@app.route("/monetka_random")
def show_monetka_random():
    return f'<p>{random.choice(monetka_list)}</p>'


@app.route("/random_fact")
def show_random_fact():
    return f'<p>{random.choice(facts_list)}</p>'


@app.route("/generate_password")
def generate_password():
    length = 10
    password = ''.join(random.choice(string.ascii_letters + string.digits) for _ in range(length))
    return f'<p>Сгенерированный пароль: {password}</p>'

if __name__ == "__main__":
    app.run(debug=True)
